; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-3-1-8-5)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos1-0 pos1-1 pos1-2 pos2-0 pos2-1 pos2-2
    shape0
    key0 key1 key2 key3 key4 key5 key6 key7
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (shape shape0)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)
       (key key6)
       (key key7)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-1)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (locked pos1-0)
       (locked pos1-1)
       (locked pos0-1)
       (locked pos0-0)
       (locked pos2-0)
       (lock-shape  pos1-0 shape0)
       (lock-shape  pos1-1 shape0)
       (lock-shape  pos0-1 shape0)
       (lock-shape  pos0-0 shape0)
       (lock-shape  pos2-0 shape0)
       (open pos0-2)
       (open pos1-2)
       (open pos2-1)
       (open pos2-2)

       (key-shape  key0 shape0)
       (key-shape  key1 shape0)
       (key-shape  key2 shape0)
       (key-shape  key3 shape0)
       (key-shape  key4 shape0)
       (key-shape  key5 shape0)
       (key-shape  key6 shape0)
       (key-shape  key7 shape0)
       (at key0 pos2-2)
       (at key1 pos1-0)
       (at key2 pos2-0)
       (at key3 pos2-0)
       (at key4 pos0-2)
       (at key5 pos2-0)
       (at key6 pos0-0)
       (at key7 pos2-1)
       (at-robot pos2-2)
    )

    (:goal (and
       (at key1 pos0-0)
       (at key2 pos0-2)
       (at key3 pos1-1)
       (at key6 pos0-1)
    )))

; plan
1. (pickup pos2-2 key0)
   deleted: (at key0 pos2-2) (arm-empty)
   added: (holding key0)
   goals met: 0 of 4
2. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 0 of 4
3. (unlock pos2-1 pos2-0 key0 shape0)
   deleted: (locked pos2-0)
   added: (open pos2-0)
   goals met: 0 of 4
4. (unlock pos2-1 pos1-1 key0 shape0)
   deleted: (locked pos1-1)
   added: (open pos1-1)
   goals met: 0 of 4
5. (move pos2-1 pos2-0)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-0)
   goals met: 0 of 4
6. (unlock pos2-0 pos1-0 key0 shape0)
   deleted: (locked pos1-0)
   added: (open pos1-0)
   goals met: 0 of 4
7. (pickup-and-loose pos2-0 key3 key0)
   deleted: (holding key0) (at key3 pos2-0)
   added: (holding key3) (at key0 pos2-0)
   goals met: 0 of 4
8. (move pos2-0 pos1-0)
   deleted: (at-robot pos2-0)
   added: (at-robot pos1-0)
   goals met: 0 of 4
9. (unlock pos1-0 pos0-0 key3 shape0)
   deleted: (locked pos0-0)
   added: (open pos0-0)
   goals met: 0 of 4
10. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 0 of 4
11. (unlock pos1-1 pos0-1 key3 shape0)
   deleted: (locked pos0-1)
   added: (open pos0-1)
   goals met: 0 of 4
12. (putdown pos1-1 key3)
   deleted: (holding key3)
   added: (arm-empty) (at key3 pos1-1)
   goals met: 1 of 4
13. (move pos1-1 pos1-0)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-0)
   goals met: 1 of 4
14. (pickup pos1-0 key1)
   deleted: (at key1 pos1-0) (arm-empty)
   added: (holding key1)
   goals met: 1 of 4
15. (move pos1-0 pos0-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos0-0)
   goals met: 1 of 4
16. (pickup-and-loose pos0-0 key6 key1)
   deleted: (holding key1) (at key6 pos0-0)
   added: (holding key6) (at key1 pos0-0)
   goals met: 2 of 4
17. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 2 of 4
18. (putdown pos0-1 key6)
   deleted: (holding key6)
   added: (arm-empty) (at key6 pos0-1)
   goals met: 3 of 4
19. (move pos0-1 pos0-0)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-0)
   goals met: 3 of 4
20. (move pos0-0 pos1-0)
   deleted: (at-robot pos0-0)
   added: (at-robot pos1-0)
   goals met: 3 of 4
21. (move pos1-0 pos2-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos2-0)
   goals met: 3 of 4
22. (pickup pos2-0 key2)
   deleted: (at key2 pos2-0) (arm-empty)
   added: (holding key2)
   goals met: 3 of 4
23. (move pos2-0 pos1-0)
   deleted: (at-robot pos2-0)
   added: (at-robot pos1-0)
   goals met: 3 of 4
24. (move pos1-0 pos0-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos0-0)
   goals met: 3 of 4
25. (move pos0-0 pos0-1)
   deleted: (at-robot pos0-0)
   added: (at-robot pos0-1)
   goals met: 3 of 4
26. (move pos0-1 pos0-2)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-2)
   goals met: 3 of 4
27. (pickup-and-loose pos0-2 key4 key2)
   deleted: (holding key2) (at key4 pos0-2)
   added: (holding key4) (at key2 pos0-2)
   goals met: 4 of 4
